# When starting from scratch, you will need to do the following:
# Install xcode command line tools
# xcode-select --install
# Install Homebrew
# ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# Install brew bundle command
# brew tap Homebrew/bundle

# Use `brew bundle` to run Brewfile

# Set application directory
cask_args appdir: "/Applications"

# Taps
tap "caskroom/cask"
tap "caskroom/eid"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"

# Binaries
brew "autoconf"
brew "awscli"
brew "bash" # Bash 4
brew "bat"
brew "coreutils" # Those that come with macOS are outdated
brew "git"
brew "gnupg2"
brew "grep"
brew "mackup"
brew "mas"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash"
brew "tree"
brew "zsh"
brew "zsh-completions"

# Development
brew "automake"
brew "coreutils"
brew "freetype"
brew "gdbm"
brew "heroku"
brew "heroku-node"
brew "icu4c"
brew "imagick"
brew "imagemagick"
brew "jpeg"
brew "libgpg-error"
brew "libksba"
brew "libpng"
brew "libtiff"
brew "libtool"
brew "libyaml"
brew "mysql"
brew "node"
brew "openssl"
brew "pearl"
brew "php"
brew "pre-commit"
brew "python"
brew "postgresql"
brew "sphinx-doc"
brew "sqlite"
brew "readline"
brew "redis"
brew "ruby"
brew "vim"
brew "xz"

# Apps
cask "docker"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "java"
cask "sublime-text"

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
