# Install some other useful utilities like `sponge`.
brew "moreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed", args:["with-default-names"]
# Install Bash 4.
brew "bash"
brew "bash-completion2"
# Install GNU core utilities (those that come with macOS are outdated).
brew "coreutils"


########################################
################# Taps #################
########################################

tap "caskroom/cask"
tap "caskroom/eid"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "mas-cli/tap", pin: true

########################################
############# Development ##############
########################################

brew "autoenv"
brew "automake" # Add make command for GNU compliant Makefiles
brew "enchant" # Add spell checking
brew "git" # Add git
brew "git-extras" # Add extra git commands
brew "gmp"
brew "howdoi" # Search for code examples from command line
brew "hub" # Add GitHub shortcuts
brew "libyaml" # YAML parser
brew "mysql" # Add MySQL
brew "node" # Add node.js
brew "openssl" # Add TLS and SSL protocols
brew "pandoc"
brew "perl" # Add Perl
brew "php" # Add PHP
brew "pre-commit" # Run commands before committing changes made in git repository
brew "python" # Add Python
brew "postgresql" # Add Postgresql
brew "shfmt" # Shell formatting for VS Code
brew "sphinx-doc" # Enable Sphinx documentation for Python projects
brew "sqlite" # Add SQLite
brew "redis" # Add redis
brew "ruby" # Add Ruby
brew "vim" # Add VIM
brew "wget" # Add wget
brew "zsh" # Add ZSH shell
brew "zsh-completions" # Add ZSH completions

########################################
############ External CLIs #############
########################################

tap "heroku/homebrew-brew" # Add heroku CLI
brew "awscli" # Official AWS CLI

########################################
########## Image Manipulation ##########
########################################

brew "imagemagick" # Image manipulation from the command line
brew "libtiff" # Reading, writing, and manipulating TIFFs

########################################
####### Other Command Line Tools #######
########################################

brew "freetype" # Software to render fonts
brew "libtool" # Generic library support script
brew "xz" # Data compression with high compression ratio
brew "autoconf"
brew "bat" # cat replacement with syntax highlighting
brew "coreutils" # Those that come with macOS are outdated
brew "grep" # Add grep functionality (ex: `grep 'search_term' filename`)
# brew "mackup" # use for syncing mac application settings through something like Dropbox
# https://github.com/lra/mackup

brew "pkg-config" # Helper tool often used when installing apps and libraries
brew "tree" # Recursive directory listing

########################################
################# LaTeX ################
########################################

cask "mactex-no-gui"


########################################
################# Apps #################
########################################

cask "visual-studio-code" # Install VS Code
cask "whatsapp" # Install Whatsapp
brew "mas" # Make installing apps from the App Store easier
# https://github.com/mas-cli/mas
cask "alfred"
cask "hyper" # Install Hyper
